using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ClassLibrary_quest
{
    public class Controller
    {
       public string [] texts = {"Герой движется к дому 1 и встречает своего соседа: 1- зайти в гости на чай, 2- короткий разговор ","Герой движется к дому 2 и встречает маньяка: 1- убежать, 2- ударить","Герой движется к дому 3 и встречает маньяка: 1- отравить, 2- обмануть ","Герой движется к дому 4 и встречает своего соседа: 1- сходить на рыбалку, 2- оказать помощь","Герой движется к дому 5 и встречает маньяка: 1- зайти без стука, 2- сыграть в покер"};
       public string [] life = {"Узнал куда идти дальше,иди прямо к следующему дому","Тебя испугались,сказали куда идти,и ты идешь налево","Ура,ты нашел карту, ты знаешь куда идти дальше и ты идешь прямо","Ты помог соседу,и в благодарность он сказал куда идти дальше,ты идёшь направо","Тебя приняли за своего и разрешили остаться на ночь"};
       public string [] death = {"Увы,ты узнал слишком мало.Попробуй ещё раз","Жаль,но тебя поймали и убили","Увы,но тебя обвинили в краже,и ты в тюрьме","На тебя обиделся сосед,за то что ты поймал больше чем он,поэтому с тобой не хотят разговаривать","На тебя напали,ты умер.Game over"};
       public int [] answers = {1,2,1,2,2};
    }


}
